## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.newrelic_log_ingestion.aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/newrelic-log-ingestion"
      + retention_in_days = 7
      + tags              = {
          + "lambda:createdBy" = "Terraform"
        }
      + tags_all          = {
          + "lambda:createdBy" = "Terraform"
        }
    }

  # module.newrelic_log_ingestion.aws_iam_role.lambda_role[0] will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "newrelic-log-ingestion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "lambda:createdBy" = "Terraform"
        }
      + tags_all              = {
          + "lambda:createdBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.newrelic_log_ingestion.aws_iam_role_policy_attachment.lambda_log_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_log_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "newrelic-log-ingestion"
    }

  # module.newrelic_log_ingestion.aws_lambda_function.ingestion_function will be created
  + resource "aws_lambda_function" "ingestion_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Sends log data from CloudWatch Logs to New Relic Infrastructure (Cloud integrations) and New Relic Logging"
      + filename                       = "temp/newrelic-log-ingestion.zip"
      + function_name                  = "newrelic-log-ingestion"
      + handler                        = "function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "lambda:createdBy" = "Terraform"
        }
      + tags_all                       = {
          + "lambda:createdBy" = "Terraform"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "INFRA_ENABLED"   = "True"
              + "LICENSE_KEY"     = (sensitive)
              + "LOGGING_ENABLED" = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.newrelic_log_ingestion.aws_lambda_permission.log_invoke_permission will be created
  + resource "aws_lambda_permission" "log_invoke_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "newrelic-log-ingestion"
      + id            = (known after apply)
      + principal     = "logs.ca-central-1.amazonaws.com"
      + source_arn    = "arn:aws:logs:ca-central-1:239043911459:log-group:*"
      + statement_id  = (known after apply)
    }

  # module.newrelic_log_ingestion.null_resource.build_lambda[0] will be created
  + resource "null_resource" "build_lambda" {
      + id = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.newrelic_log_ingestion.aws_cloudwatch_log_group.lambda_logs"]
WARN - plan.json - main - Missing Common Tags: ["module.newrelic_log_ingestion.aws_iam_role.lambda_role[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.newrelic_log_ingestion.aws_lambda_function.ingestion_function"]

34 tests, 14 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
